NEURONETZE:
http://kubstu.ru/data/fdlist/FDD0445.pdf


GITHUB-LINKS:
https://github.com/zhangry868?tab=repositories



ONLINE-BOOCKS:

/////////////////////////////////////////// RUSSIAN:
Джеффри РИХТЕР "Windows для профессионалов"
ПРОГРАММИРОВАНИЕ НА ЯЗЫКЕ СИ
Бьярн Страустрап. Введение в язык Си++
Хрестоматия по программированию на Си в Unix
Справочное руководство по C++
Visual C++ / FAQ Index

/////////////////////////////////////////// DEUTSCH:
http://www.highscore.de/cpp/aufbau/

// SOME LINKS:
https://www.gulp.de/freiberufler/E05BEE62.html





C:\statji.txt
"семантический анализ применение"
"направления исследования сематического анализа"

https://toster.ru/q/31851
Достижимые цели у этой задачи сейчас такие: 
* автокаталог (поток новостей распихивать по темам)
* автореферат (из текста выбрать — или составить — то, что его вкратце опишет, и при поиске показать)
Недостижимая на сегодня цель — выделить сущности, устранить синтаксическую и семантическую неоднозначность, сохранить связи и отношения в базе знаний (пример: из текста этой статьи узнать о новой единице измерения и уметь переводить её в литры). То есть понять смысл текста так, как его понимает человек. 
Если про своё про практическое, то я участвовал недолго в этом проекте. Применял его (ох...) для авто-реврайта текстов с учётом контекста (чтоб в тексте про машины заменяла бы слово «oil» на «petroleum», но никак не на «flattery»).

http://www.derwhite.com/2012/09/02/pochti-ideya-programmy-pochti-dlya-semanticheskogo-analiza-teksta/
Вы можете связаться со мной по почте hello@derwhite.com или через skype podluzny. Мне интересны новые и нестандартные задачи, поэтому я с удовольствием с вами пообщаюсь по профессиональным вопросам.

http://www.apmath.spbu.ru/ru/info/tuzov/onapr.html
поиск документов в локальных и глобальных сетях,
сортировка и классификация документов,
автоматическое аннотирование и реферирование,
системы автоматического контроля,
вопросно-ответные системы,
диалоговые системы,
обучающие и обучающиеся системы,
модификация и пополнение баз знаний,
экспертные системы,
машинный перевод.

Семантический анализ  текстов с использованием  системы Texterra
//
Викификация является разновидностью за-
дачи разрешения лексической многозначности, в которой в качестве источ-
ника знаний выступают статьи Википедии.

/ Семантической паутины (Semantic web),

/ Семантический перевод

/ построение текстов по заданному смысловому заданию (машинный
перевод, вопросно-ответные системы, извлечение информации из текстов и др.);

/ Генерация текстов
Формирование контента на сайтах / форумах / и т.д.

/ Тезисный разбор текста
Совершенно верно. Средств (программ) совмещающих в себе текстовое представление и параллельное отображение в компактном виде основных ключевых мыслей (фраз) не знаю, но необходимость давно назрела. На первом этапе достаточно будет, что бы пользователь сам формировал структуру текста в в виде какой либо нотации (MindMap, ДРАКОН и т.д.). Как вариант для использования алгоритма обработки текста можно использовать метод Едигес А.П., приведенный в книге «Лабиринты мышления, или учеными не рождаются».

/ Обучение
Появилась интересная программа http://www.activelylearn.com/ , но она ориентирована на область образования.

/ ПОИСК ЗАПРОСОВ
Мы думаем про что-то такое для своего проекта — человек пишет в поиск, де, «трёхкомнатная вилла на Майорке в конце августа» — и ему хоп, показывает результаты поиска с точно заданными параметрами.

РЕКЛАМА / ПРЕДЛОЖЕНИЯ / МАРКЕТИНГ:
Очень насущная задача много для чего — это автоматическая классификация. Например, из длинного пространного описания гаечных ключей понять, что они бывают такие и такие, ключ номер 1 такой, а ключ номер три — другой.

БИРЖА:
вот мы делаем системы для создания технологических форсайтов (это что-то среднее между планами и прогнозами). Люди собирают т.н. сигналы — события, которые могут быть важными для отрасли, и на основе нескольких сигналов у них должны появляться идеи трендов. Сигналов много, поэтому хочется показывать пользователю небольшие группы сигналов, которые связаны между собой или как-либо похожи. Тут бы очень пригодился классификатор.
