- выделить машину
- выделить салон
Разномасность фотографий:
-- сколько, по каким критериям, углы, ракурсы, порядок. Как их классифицировать / отбор по каким критериям.
  
- стоимость запчасти
- определить степень повреждения
- мин / средняя / тоталь - разбираются специалисты
- средние истории убытков

--- прогнозирование
--- поиск аномалий (мошенничество)
  - anti prod - огромные массивы данных. Распознавание плохих и хороших паттернов.
  - по нахождению плохих паттернов можно


РАСПОЗНАВАНИЕ ОБРАЗОВ:
Минимальная доступная теория:
http://ict.informika.ru/ft/005972/m08-204.pdf


Библиотеки:
1) OpenCV
- Распознавание образов с OpenCV: Контуры против Haartraining
  Установив среду я приступил, наконец, к созданию своих первых HelloWord`ов. 
  Советую пробежаться по OpenCV шаг за шагом - http://robocraft.ru/page/opencv/
  Я перепробовал массу англоязычных и русскоязычых статей и форумов. Этот сборник статей наиболее понятно описывает функционал библиотеки OpenCV. 
  В первых статьях этого мануала описывается довольно простой алгоритм захвата видео с web-камеры, http://robocraft.ru/blog/computervision/275.html
  а в кульминации этих статей я нашел, наконец, как выделять и сравнивать контуры.
http://www.pvsm.ru/algoritmy/30704

КОНТУРЫ - Нахождение, Выделение, Сравнение:
http://blog.vidikon.com/?cat=1

- Распознавание образов для программистов с использованием библиотеки OpenCV -- Детектирование объектов с помощью особенностей в OpenCV: FREAK. Детектирование множества объектов.
http://recog.ru/blog/opencv/
http://recog.ru/blog/opencv/200.html (with code)

YOUTUBE:
Face recognition and training in opencv - https://www.youtube.com/watch?v=WfrHM24aFIE
Распознавание номеров авто - http://recog.ru/blog/applied/202.html

GITHUB:
Распознавание номеров авто - OpenCV 3 License Plate Recognition C++ full source code
https://www.youtube.com/watch?v=euG7-o9oPKg
https://github.com/MicrocontrollersAndMore/OpenCV_3_License_Plate_Recognition_Cpp
Распознавание Автомобилей - OpenCV 3 Car Counting C++ full source code
https://www.youtube.com/watch?v=Y3ac5rFMNZ0
https://github.com/MicrocontrollersAndMore/OpenCV_3_Car_Counting_Cpp

COURSE.ZIP
Разработка приложения для распознавания графических образов.
http://www.zoonman.ru/projects/kw/






/////////////////////////////////////////////////////////////////////////////////////////
НЕЙРОННЫЕ СЕТИ:
СОВЕТЫ: https://geektimes.ru/post/211610/
http://masandilov.ru/ai/neural_networks
http://evloevoleg.narod.ru/Neural/Par_4.pdf

РАЗРАБОТКА И ТЕОРИЯ:
http://algolist.manual.ru/ai/neuro/index.php
ЛУЧШИЙ ПРИМЕР С ОБЪЯСНЕНИЕМ И КОДОМ НА СИ++
https://www.youtube.com/watch?v=KkwX7FkLfug

ВАРИАНТЫ НЕЙРОННЫХ СЕТЕЙ:
Многослойные ПЕРЦЕПТРОНЫ - http://forum.pascal.net.ru/index.php?showtopic=25644 (МЕТОДИЧКА с описанием +ошибка в формуле последний пост)
Нейронная сеть Коххана - 
Нейронная сеть Хопфилда 
  text recognition
  https://software.intel.com/ru-ru/blogs/2011/12/22/finereader-2 (with code)

СПИСОК БИБЛИОТЕК:
http://bookflow.ru/nejrosetevoe-programmnoe-obespechenie/
1) БиблиотекаCaffe
http://mechanoid.kiev.ua/ml-lenet.html
2) Библиотека FANN. Создание простой нейронной сети на C++
http://leenissen.dk/fann/wp/language-bindings/
http://1q5p6.blogspot.ru/2015/11/fann.html
Скачать ALGLIB
http://alglib.sources.ru/dataanalysis/neuralnetworks.php

ПРИМЕР:
http://www.codeproject.com/Articles/19323/Image-Recognition-with-Neural-Networks
https://software.intel.com/ru-ru/blogs/2011/12/22/finereader-2
http://netcode.ru/cpp/?skatID=105&artID=3994
// NEURALNET.ZIP

ПОСЛЕДНИЕ НОВОСТИ О НЕЙРОННЫХ СЕТЯХ:
https://tproger.ru/tag/neural-network/


NEURONETZE:
http://kubstu.ru/data/fdlist/FDD0445.pdf

ARTICLES:
http://www.ipol.im/pub/art/2015/137/article_lr.pdf
http://neuroph.sourceforge.net/image_recognition.html

Pattern Recognition and Image Processing in C++
http://www.springer.com/gp/book/9783528054915

Programms:
https://sourceforge.net/directory/os:windows/?q=image%20pattern%20recognition


GITHUB-LINKS:
https://github.com/zhangry868?tab=repositories

Capture Screen and save to AVI (Borland C++)
http://www.cyberforum.ru/cpp-builder/thread140321.html


ONLINE-BOOCKS:

/////////////////////////////////////////// RUSSIAN:
Джеффри РИХТЕР "Windows для профессионалов"
ПРОГРАММИРОВАНИЕ НА ЯЗЫКЕ СИ
Бьярн Страустрап. Введение в язык Си++
Хрестоматия по программированию на Си в Unix
Справочное руководство по C++
Visual C++ / FAQ Index

C++ в хадачах и примерах (Borland C++)

50 КНИГ ПО С++
http://www.ph4s.ru/bookprogramir_1.html  

BORLAND C++ TOOLS
http://www.cnpack.org/showlist.php?id=39&lang=en


/////////////////////////////////////////// DEUTSCH:
http://www.highscore.de/cpp/aufbau/

// SOME LINKS:
https://www.gulp.de/freiberufler/E05BEE62.html





C:\statji.txt
"семантический анализ применение"
"направления исследования сематического анализа"

https://toster.ru/q/31851
Достижимые цели у этой задачи сейчас такие: 
* автокаталог (поток новостей распихивать по темам)
* автореферат (из текста выбрать — или составить — то, что его вкратце опишет, и при поиске показать)
Недостижимая на сегодня цель — выделить сущности, устранить синтаксическую и семантическую неоднозначность, сохранить связи и отношения в базе знаний (пример: из текста этой статьи узнать о новой единице измерения и уметь переводить её в литры). То есть понять смысл текста так, как его понимает человек. 
Если про своё про практическое, то я участвовал недолго в этом проекте. Применял его (ох...) для авто-реврайта текстов с учётом контекста (чтоб в тексте про машины заменяла бы слово «oil» на «petroleum», но никак не на «flattery»).

http://www.derwhite.com/2012/09/02/pochti-ideya-programmy-pochti-dlya-semanticheskogo-analiza-teksta/
Вы можете связаться со мной по почте hello@derwhite.com или через skype podluzny. Мне интересны новые и нестандартные задачи, поэтому я с удовольствием с вами пообщаюсь по профессиональным вопросам.

http://www.apmath.spbu.ru/ru/info/tuzov/onapr.html
поиск документов в локальных и глобальных сетях,
сортировка и классификация документов,
автоматическое аннотирование и реферирование,
системы автоматического контроля,
вопросно-ответные системы,
диалоговые системы,
обучающие и обучающиеся системы,
модификация и пополнение баз знаний,
экспертные системы,
машинный перевод.

Семантический анализ  текстов с использованием  системы Texterra
//
Викификация является разновидностью за-
дачи разрешения лексической многозначности, в которой в качестве источ-
ника знаний выступают статьи Википедии.

/ Семантической паутины (Semantic web),

/ Семантический перевод

/ построение текстов по заданному смысловому заданию (машинный
перевод, вопросно-ответные системы, извлечение информации из текстов и др.);

/ Генерация текстов
Формирование контента на сайтах / форумах / и т.д.

/ Тезисный разбор текста
Совершенно верно. Средств (программ) совмещающих в себе текстовое представление и параллельное отображение в компактном виде основных ключевых мыслей (фраз) не знаю, но необходимость давно назрела. На первом этапе достаточно будет, что бы пользователь сам формировал структуру текста в в виде какой либо нотации (MindMap, ДРАКОН и т.д.). Как вариант для использования алгоритма обработки текста можно использовать метод Едигес А.П., приведенный в книге «Лабиринты мышления, или учеными не рождаются».

/ Обучение
Появилась интересная программа http://www.activelylearn.com/ , но она ориентирована на область образования.

/ ПОИСК ЗАПРОСОВ
Мы думаем про что-то такое для своего проекта — человек пишет в поиск, де, «трёхкомнатная вилла на Майорке в конце августа» — и ему хоп, показывает результаты поиска с точно заданными параметрами.

РЕКЛАМА / ПРЕДЛОЖЕНИЯ / МАРКЕТИНГ:
Очень насущная задача много для чего — это автоматическая классификация. Например, из длинного пространного описания гаечных ключей понять, что они бывают такие и такие, ключ номер 1 такой, а ключ номер три — другой.

БИРЖА:
вот мы делаем системы для создания технологических форсайтов (это что-то среднее между планами и прогнозами). Люди собирают т.н. сигналы — события, которые могут быть важными для отрасли, и на основе нескольких сигналов у них должны появляться идеи трендов. Сигналов много, поэтому хочется показывать пользователю небольшие группы сигналов, которые связаны между собой или как-либо похожи. Тут бы очень пригодился классификатор.
