Меня зовут ОПА. Мне 30 лет. На данный момент я работаю программистом в страховой компании, в которой я занимаюсь разработкой 
фронт-офисной части АРМа документооборота внутренних договоров компании.
В 2004 году я поступил в МИЭМ. Московский институт электроники и математики на Факультет прикладной математики, специальность Компьютерная Безопасности.
На 2 курсе институа я начал работать Системным администратором, чтобы начать получать первый опыт работы в IT-индустрии.
Я параллельно работал и учился и потому работал лишь на пол ставки, чтобы была возможность совмещать работу и учёбу.
В конце 4 курса нам пре
